[
  "Best Paper Award by KIIS - Chaerim Park and Taehun Kim and Seung-Hyeon Moon and Yong-Hyuk Kim (2025)",
  "Best Paper Award by KIIS - So-Jung Lee and Yong-Hyuk Kim (2024)",
  "Best Paper Award by KIIS - Seung-Yeol Hong and Yong-Hyuk Kim (2024)",
  "Best Paper Award by KICS - Tae-Hoon Kim and Seung-Hyeon Moon and Yong-Huyk Kim (2023)",
  "KCC Undergraduate Paper Competition Encouragement Award - Tae-Hwan Kim and Su-bin Kim and Yong-Hyuk Kim (2021)",
  "Best Paper Award by KIIS - Hye-Jin Kim and Yong-Hyuk Kim (2018)",
  "Best Paper Award by KIIS - Gyoung-Do Kim and Yong-Hyuk Kim (2018)",
  "Graduation Exhibition Encouragement Prize by Dept. of Computer Science and engineering, Kwangwoon university - SeungHwan Lee, Sejun Oh, Huisik Jeon (Advisor: Yong-Hyuk Kim) (2017)",
  "Graduation Exhibition Encouragement Prize by Dept. of Computer Science and engineering, Kwangwoon university - Hwi-Yeon Cho, Hye-Jin Kim, Min-Jung Lee, En-Chan Lee (Advisor: Yong-Hyuk Kim) (2017)",
  "HwaDo Academy Award (2017)",
  "Best Paper Award by HSST - Jung-Hwan Lee, Yong-Hyuk Kim, Yong-Hee Lee (2017)",
  "ACE Excellent Lecture Award - Data structure (2016)",
  "Best Paper Award by KIIS - Ji-Hun Ha, Yong-Hyuk Kim, Hyo-hyeok Im, Deok-Hwan Choi, Yong-Hee Lee (2016)",
  "Best Paper Award by KIIS - Jong-Hwan Lee, Hui-Chan Yoo, Yong-Beom Jo, Yong-Wook Nam, Yong-Hyuk Kim (2016)",
  "KWIX (Kwangwoon IT Exhibition) Excellence Prize (2016)",
  "Graduation Exhibition Encouragement Prize by Dept. of Computer Science and engineering, Kwangwoon university - Hong-Gyu Sung, Chan-Hee Jo, Sung-Ha Lee (Advisor: Yong-Hyuk Kim) (2016)",
  "Award by National Institute of Meteorological Science (2016)",
  "ACE Excellent Lecture Award - Advanced programming (2015)",
  "Best Paper Award by KIIS - Yong-Hyuk Kim, Ji-Hun Ha, Yong-Hee Lee (2015)",
  "Graduation Exhibition Encouragement Prize by Dept. of Computer Science and engineering, Kwangwoon university - Jae-Gwan Jang, Jun-ho Sin, Ji-Hun Park, Seong-Jae Jo (Advisor: Yong-Hyuk Kim) (2015)",
  "KWIX (Kwangwoon IT Exhibition) Excellence Prize (2014)",
  "KWIX (Kwangwoon IT Exhibition) Excellence Prize (2008)"
]
