[
  "Approximation and Landscape Analysis of Surrogate Models Using Deep Neural Networks and Machine Learning, NRF, June. 2021 - February. 2024",
  "Development of AI-based Marine Search & Rescue Decision Support System, Korea Institute of Marine Science & Technology Promotion (KIMST), Jan.2023 - Dec.2026",
  "Development of Detailed Weather Data Production and Service Technology for Private Use, Korea Meteorological Institute, Apr. 2019 - Dec. 2021",
  "Marine Oil Spill Risk Assessment and Development of Response Support System through Big Data Analysis (Development of Machine Learning based Optimization Algorithm), Korea Coast Guard, May 2016 - Dec. 2020",
  "Improvement of Precipitation Quantitative Forecast on Numerical Forecasting Models (III), KMA, May 2017 - Nov. 2017",
  "Development of Base Technology for Applying Numerical Forecast on Ground Remote Observation Data (II), NIMS, Apr. 2017 - Nov. 2017",
  "Improvement of Precipitation Quantitative Forecast on Numerical Forecasting Models (II), NIMS, Jun. 2016 - Dec. 2016",
  "Marine Oil Spill Risk Assessment and Development of Response Support System through Big Data Analysis (Development of Machine Learning based Optimization Algorithm), Korea Coast Guard, May 2016 - Dec. 2020",
  "Development of Base Technology for Applying Numerical Forecast on Ground Remote Observation Data, NIMS, Apr. 2016 - Nov. 2016",
  "Effective scheduling of residential energy storage systems under dynamic pricing, Kwangwoon University, Mar. 2016 - Feb. 2017",
  "An Edge-Set Representation Based on a Spanning Tree for Searching Cut Space, Kwangwoon University, Mar. 2015 - Feb. 2016",
  "A Study on Analysis Engine of Big Data of Networks and Texts and Recommender System as Its Application, NRF, Nov. 2015 - Oct. 2018",
  "Research on Basic Technology for Optimal Observation of Local Jeopardy Weather (IV): Development and Evaluation of Quality-Control Algorithm of AWS Data Based on Machine Learning and Statistical Techniques, NIMS, Apr. 2015 - Nov. 2015",
  "Automated User-Pattern Extraction and Standard Scenario Draw through Analyzing of Situation Information of Automobile Users, Hyundai NGV, Aug. 2014 - Feb. 2015",
  "Estimation of the speed of sound-emitted objects through analyzing sound information, and development of its related application, KOFAC, May 2014 - Dec. 2014 (with Sejong Science High School)",
  "Development of Basic Technology for Jeopardy Weather Forecasting Using Nowcasting Data (II): Development of AWS Quality-Control Algorithm Using Machine Learning Techniques, NIMR, Jun. 2014 - Nov. 2014",
  "Correcting Air-Pressure Data Collected by MEMS Sensors in Smartphones, Kwangwoon University, Mar. 2014 - Feb. 2015",
  "Development of Basic Technology for Jeopardy Weather Forecasting Using Nowcasting Data (I): Improvement of  Heavy-rainfall Prediction Guidance Using Real-time Classifiers and Optimization Techniques, NIMR, May 2013 - Nov. 2013",
  "New Bucket Managements in Iterative Improvement Partitioning Algorithms, Kwangwoon University, Mar. 2013 - Feb. 2014",
  "Improvement of Performance in Very-short Range Forecast Model with Nowcasting Data (III): Development of Heavy-rainfall Prediction Guidance Using Real-time Classifiers and Optimization Techniques, NIMR, Apr. 2012 - Nov. 2012",
  "A Research on Improvement Plan about Equipment Standards of Remote University, KERIS, Jul. 2012 - Aug. 2012",
  "Geometricity of genetic operators for real-coded representation, Kwangwoon University, Mar. 2012 - Feb. 2013",
  "A theoretical and empirical investigation on the Lagrangian capacities of the 0-1 multidimensional knapsack problem, Kwangwoon University, May. 2011 - Apr. 2012",
  "Improvement of Performance in Very-short Range Forecast Model with Nowcasting Data (II): Design of Short-term Rainfall Prediction Algorithms Using Real-Time Classifier and Optimization Technique, NIMR, Apr. 2011 - Nov. 2011",
  "Analysis and Applications of Social Network Based on Efficient Crawling of Twitter Information, NRF, May 2010 - Apr. 2013",
  "A Genetic Approach to Analyze Algorithm Performance Based on the Best-Case and Worst-Case Instances, Kwangwoon University, May. 2010 - Apr. 2011",
  "Technology Study and SoC Development for Secure Vision Recognition, ETRI, Mar. 2010 - Nov. 2010, Mar. 2011 - Nov. 2011",
  "Optimal Design of Ambiguous Mobile Keypad, Kwangwoon University, May. 2009 - Apr. 2010",
  "Development of Widget Contents Based on Teleca Mobile Widget Ecosystem, Obigo Korea, Nov. 2008 - Jan. 2009",
  "Development of Teaching Material \"Introduction to Embedded Software\", Korea SW Industry Promotion Agency, Sep. 2008 - Dec. 2008",
  "Analysis of Algebraic and Topological Structures in Various Discrete Spaces  and Discrete Optimization as Its Application, Korea Research Foundation, July. 2008 - June. 2009",
  "An Enzyme-Inspired Approach to Surmount Barriers in Graph Bisection, Kwangwoon University, May. 2008 - Apr. 2009",
  "Pattern Analysis and Prediction System of Mobile Device Users, Samsung Electronics, May. 2008 - Feb. 2009",
  "A Lagrangian Approach for Multiple Personalized Campaigns, Kwangwoon University, May. 2007 - Apr. 2008",
  "Research and Development of Search Engine, Service at CDO of Daum Communications Corp., Mar. 2006 - Nov. 2006",
  "Genetic Algorithms for Pattern Recognition, Grant No. (R01-2003-000-10879-0) from the Basic Research Program of the Korea Science and Engineering Foundation, May. 2005 - Aug. 2006",
  "A Study on the Background Transformation of Video Phones for Privacy, KT Corp., Apr. 2004 - Dec. 2004",
  "Development of Alignment,  Phylogeny, and Database Management System for Biomedical Molecular Markers, Grant of the International Mobile Telecommunications 2000 R&D Project, Ministry of Information and Communication,  Republic of Korea, Dec. 2001 - Nov. 2003",
  "Hierarchical Genetic One-to-One Marketing System for Intelligent EC, Grant from Ministry of Information and Communication Ministry of Information and Communication,  Republic of Korea, Mar. 2000 - Feb. 2001"
]
