{
    "refereed book chapters/editorial": {
        "header": "Refereed Book Chapters/Editorial",
        "body": [
            "Yourim Yoon and Yong-Hyuk Kim, The Roles of Crossover and Mutation in Real-coded Genetic Algorithms, Bio-Inspired Computational Algorithms and Their Applications, edited by Shangce Gao, Chapter 4, pages 65-82, InTech, March 2012, ISBN 979-953-307-599-9. (Reached 3,000 downloads on Sep 17, 2013, corresponding author)",
            "Yong-Hyuk Kim, Ahmed Kattan, Michael Kampouridis, and Yourim Yoon, Discrete Dynamics in Evolutionary Computation and Its Applications, Hindawi Publishing Corporation Discrete Dynamics in Nature and Society Volume 2016, Article ID 6043597, 2 pages"
        ]
    },
    "selected refereed international journal papers": {
        "header": "Selected Refereed International Journal Papers",
        "body": [
            "Yourim Yoon and Yong-Hyuk Kim, Effective Scheduling of Residential Energy Storage Systems under Dynamic Pricing, Renewable Energy, September 2015. (SCI-E, IF2014: 3.476, in press, corresponding author)",
            "Yong-Hyuk Kim and Yourim Yoon, A Genetic Filter for Cancer Classification on Gene Expression Data, Bio-Medical Materials and Engineering, 26:S1993-S2002, August 2015. (SCI-E, IF2014: 1.091)",
            "Kisung Seo, Soohwan Hyun, and Yong-Hyuk Kim, An Edge-set Representation Based on Spanning Tree for Searching Cut Space, IEEE Transactions on Evolutionary Computation, 19(4):465-473, August 2015. (SCI, IF2013: 5.545, 1/102, Q1, corresponding author)",
            "Jae-Hyun Seo and Yong-Hyuk Kim, A Review on Market Trends and Applications on Mobile Cloud Computing, International Journal of Applied Engineering Research, 10(12):31635-31640, June 2015. (SCOPUS, corresponding author)",
            "Jae-Hyun Seo, Eun-Sol Ko, and Yong-Hyuk Kim, Performance Comparison of Genetic Algorithms Varying Population Size Based on CUDA, International Journal of Applied Engineering Research, 9(24):24765-24772, December 2014. (SCOPUS, corresponding author)",
            "Yourim Yoon and Yong-Hyuk Kim, Vertex Ordering, Clustering, and Their Application to Graph Partitioning, Applied Mathematics & Information Sciences, 8(1):135-138, January 2014. (SCOPUS, corresponding author)",
            "Yourim Yoon and Yong-Hyuk Kim, An Efficient Genetic Algorithm for Maximum Coverage Deployment in Wireless Sensor Networks, IEEE Transactions on Cybernetics, 43(5):1473-1483, October 2013. (SCI, IF2013: 3.781, 1/24, Q1, link, corresponding author)",
            "Yourim Yoon and Yong-Hyuk Kim, Geometricity of Genetic Operators for Real-coded Representation, Applied Mathematics and Computation, 219(23):10915-10927, August 2013. (SCI-E, IF2013: 1.600, 30/250, Q1, link, corresponding author)",
            "Gyung-Mok Yoon, Yong-Hyuk Kim, and Byung-Ro Moon, Multiple Personalized Recommendations with Various Response Suppression Patterns, International Journal of Advanced Computer Science, 3(6):267-273, June 2013.",
            "Hyunmin Kim, Yourim Yoon, and Yong-Hyuk Kim, Novel Genetic Designs of Efficient Ambiguous Mobile Keypad, INFORMATION-An International Interdisciplinary Journal, 16(5):3197-3210, May 2013. (SCOPUS, corresponding author)",
            "Yourim Yoon and Yong-Hyuk Kim, New Bucket Managements in Iterative Improvement Partitioning Algorithms, Applied Mathematics & Information Sciences, 7(2):529-532, March 2013. (SCOPUS, corresponding author)",
            "Gyung-Mok Yoon, Jin Kim, Yong-Hyuk Kim, and Byung-Ro Moon, Performance Improvement by Genetic Feature Selection and Adjusting Ratings' Mid-point Value in the Neural Network-Based Recommendation Models, Advances in Information Sciences and Service Sciences, 4(11):37-43, June 2012. (SCOPUS)",
            "Yourim Yoon, Yong-Hyuk Kim, and Byung-Ro Moon, A Theoretical and Empirical Investigation on the Lagrangian Capacities of the 0/1 Multidimensional Knapsack Problem, European Journal of Operational Research, 218(2):366-376, April 2012. (SCI-E, IF2013: 1.843, 15/79, Q1, link, corresponding author)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, and Byung-Ro Moon, Quotient Geometric Crossovers and Redundant Encodings, Theoretical Computer Science, 425:4-16, March 2012. (SCI, IF2013: 0.516, 76/102, Q3, link)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, and Byung-Ro Moon, A Theoretical and Empirical Study on Unbiased Boundary-extended Crossover for Real-valued Representation, Information Sciences, 183(1):48-65, January 2012. (SCI, IF2013: 3.893, 8/135, Q1, link)",
            "Yourim Yoon, Yong-Hyuk Kim, and Byung-Ro Moon, A Note on Edge-based Graph Partitioning and its Linear Algebraic Structure, Journal of Mathematical Modelling and Algorithms, 10(3):269-276, September 2011. (SCOPUS, link)",
            "So-Yeong Jeon and Yong-Hyuk Kim, A Genetic Approach to Analyze Algorithm Performance Based on the Worst-case Instances, Journal of Software Engineering and Applications, 3(8):767-775, August 2010. (corresponding author)",
            "Sung-Pil Hong and Yong-Hyuk Kim, A Genetic Algorithm for Joint Replenishment Based on the Exact Inventory Cost, Computers & Operations Research, 36(1):167-175, January 2009. (SCI-E, DOI, journal site, IF2013: 1.718, 10/43, Q1, corresponding author)",
            "Jae-Hyun Seo, Yong-Hyuk Kim, Hwang-Bin Ryou, Si-Ho Cha, and Minho Jo, Optimal Sensor Deployment for Wireless Surveillance Sensor Networks by a Hybrid Steady-state Genetic Algorithm, IEICE Transactions on Communications, E91-B(11):3534-3543, November 2008. (SCI, link, IF2013: 0.326, 73/78, Q4)",
            "Yong-Hyuk Kim and Yourim Yoon, Effect of Changing the Basis in Genetic Algorithms Using Binary Encoding, KSII Transactions on Internet and Information Systems, 2(4):184-193, August 2008. (SCI-E, pdf, IF2013: 0.345, 127/135, Q4)",
            "Yong-Hyuk Kim and Keomkyo Seo, Two Congruence Classes for Symmetric Binary Matrices over F2, WSEAS Transactions on Mathematics, 7(6):339-343, June 2008. (link, acceptance rate: 13.45%, SCOPUS, pdf)",
            "Yong-Hyuk Kim, Yourim Yoon, and Byung-Ro Moon, A Lagrangian Approach for Multiple Personalized Campaigns, IEEE Transactions on Knowledge and Data Engineering, 20(3):383-396, March 2008. (SCI, cover, DOI, link, IF2013: 1.815, 25/135, Q1)",
            "Alberto Moraglio, Yong-Hyuk Kim, Yourim Yoon, and Byung-Ro Moon, Geometric Crossovers for Multiway Graph Partitioning, Evolutionary Computation, 15(4):445-474, Winter 2007. (SCI-E, DOI, journal site, IF2013: 3.733, 4/102, Q1)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Multicampaign Assignment Problem, IEEE Transactions on Knowledge and Data Engineering, 18(3):405-414, March 2006. (SCI, cover, DOI, link, IF2013: 1.815, 25/135, Q1)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Investigation of the Fitness Landscapes in Graph Bipartitioning: An Empirical Study, Journal of Heuristics, 10(2):111-133, March 2004. (SCI-E, link, IF2013: 1.359, 27/102, Q2)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Lock-Gain Based Graph Partitioning, Journal of Heuristics, 10(1):37-57, January 2004. (SCI-E, link, IF2013: 1.359, 27/102, Q2)",
            "Yong-Hyuk Kim,Yourim Yoon, Zong Woo Geem, Acomparisonstudyofharmonysearchandgeneticalgorithmforthe max-cutproblem, Swarm and Evolutionary Computation, 1-6, January 2018.",
            "Ki Bum Kim, Yong-Hyuk Kim, Yourim Yoon, Finding the Quickest Straight-Line Trajectory for a Three-Wheeled Omnidirectional Robot under Input Voltage Constraints,  Hindawi Publishing Corporation Mathematical Problems in Engineering Volume 2015, Article ID 105357, 11 pages",
            "Yong-Wook Nam and Yong-Hyuk Kim, Finding influential opinion by filtering commercial tweets, Indian Journal of Science and Technology, Vol 9(S1), DOI: 10.17485/ijst/2016/v9iS1/109897, December 2016",
            "Yong-Hyuk Kim and Yourim Yoon, Accounting for Recent Changes of Gain in Dealing with Ties in Iterative Methods for Circuit Partitioning, Hindawi Publishing Corporation Discrete Dynamics in Nature and Society Volume 2015, Article ID 162050, 8 pages.",
            "Inwook Hwang, Yong-Hyuk Kim, and Yourim Yoon, Moving Clusters within a Memetic Algorithm for Graph Partitioning, Hindawi Publishing Corporation Mathematical Problems in Engineering Volume 2015, Article ID 238529, 10 pages",
            "Na-Young Kim, Yong-Hyuk Kim, Yourim Yoon, Hyo-Hyuc Im, Reno K. Y. Choi, and Yong Hee Lee, Correcting Air-Pressure Data Collected by MEMS Sensors in Smartphones, Hindawi Publishing Corporation Journal of Sensors Volume 2015, Article ID 245498, 10 pages",
            "Yong-Hyuk Kim and Yourim Yoon, Linkage-Based Distance Metric in the Search Space of Genetic Algorithms, Hindawi Publishing Corporation Mathematical Problems in Engineering Volume 2015, Article ID 680624, 6 pages",
            "Yong-Wook Nam and Yong-Hyuk Kim, Prediction of Drifter Trajectory Using Evolutionary Computation, Hindawi Discrete Dynamics in Nature and Society Volume 2018, Article ID 6848745, 15 pages",
            "Jae-Hyun Seo, Yong Hee Lee, and Yong-Hyuk Kim, Feature Selection for Very Short-Term Heavy Rainfall Prediction Using Evolutionary Computation, Hindawi Publishing Corporation Advances in Meteorology Volume 2014, Article ID 203545, 15 pages",
            "Yong-Hyuk Kim and Yourim Yoon, Spatiotemporal Pattern Networks of Heavy Rain among Automatic Weather Stations and Very-Short-Term Heavy-Rain Prediction, Hindawi Publishing Corporation Advances in Meteorology Volume 2016, Article ID 4063632, 13 pages",
            "Yong-Hyuk Kim, Ji-Hun Ha, Yourim Yoon, Na-Young Kim, Hyo-Hyuc Im, Sangjin Sim, and Reno K. Y. Choi, Hindawi Publishing Corporation Computational Intelligence and Neuroscience Volume 2016, Article ID 9467878, 12 pages",
            "Chanju Jung, Yong-Hyuk Kim, Yourim Yoon, and Byung-Ro Moon, A New Adaptive Hungarian Mating Scheme in Genetic Algorithms, Hindawi Publishing Corporation Discrete Dynamics in Nature and Society Volume 2016, Article ID 3512546, 13 pages",
            "Yourim Yoon and Yong-Hyuk Kim, A Memetic Lagrangian Heuristic for the 0-1 Multidimensional Knapsack Problem, Hindawi Publishing Corporation Discrete Dynamics in Nature and Society Volume 2013, Article ID 474852, 10pages",
            "Yong-Hyuk Kim, Sehoon Seo, Yong-HoHa, Seongwon Lim, and Yourim Yoon, Two Applications of Clustering Techniques to Twitter: Community Detection and Issue Extraction, Hindawi Publishing Corporation Discrete Dynamics in Nature and Society  Volume 2013, Article ID 903765, 8pages",
            "Hye-Jin Kim and Yong-Hyuk Kim, Recent Researches on Application and Influence of Twitter, International Journal of Applied Engineering Research ISSN 0973-4562 Volume 11, Number 11 (2016) pp 7501-7504",
            "Hye-Jin Kim and Yong-Hyuk Kim, Efficient Methods for Detecting Spam through Analyzing Tweets, International Journal of Applied Engineering Research ISSN 0973-4562 Volume 11, Number 15 (2016) pp 8448-8451",
            "Ji-Hun Ha and Yong-Hyuk Kim, A Survey on Data Correction of Observation and Prediction Using Machine Learning: Preliminary Study for Optimizing Oil Spill Model, International Journal of Applied Engineering Research ISSN 0973-4562 Volume 11, Number 16 (2016) pp 8892-8895",
            "Hye-Jin Kim and Yong-Hyuk Kim, Classifying Copyrighted Designs through Convolutional Neural Networks, International Journal of Applied Engineering Research ISSN 0973-4562 Volume 13, Number 1 (2018) pp. 590-597",
            "Jae-Hyun Seo, Yourim Yoon, and Yong-Hyuk Kim, An Efficient Large-Scale Sensor Deployment Using a Parallel Genetic Algorithm Based on CUDA, Hindawi Publishing Corporation International Journal of Distributed Sensor Networks Volume 2016, Article ID 8612128, 17 pages",
            "Jae-Hyun Seo, Yourim Yoon and Yong-Hyuk Kim, Coverage problem in camera-based sensor networks using the CUDA platform, International Journal of Distributed Sensor Networks 2017, Vol. 13(12)   The Author(s) 2017 DOI: 10.1177/1550147717746353",
            "Yong-Hyuk Kim and Yourim Yoon, Context Prediction of Mobile Users Based on Time-Inferred Pattern Networks: A Probabilistic Approach, Hindawi Publishing Corporation  Mathematical Problems in Engineering Volume 2013, Article ID 106139, 10pages",
            "Yong-Hyuk Kim, Alberto Moraglio, Ahmed Kattan, and Yourim Yoon, Geometric Generalisation of Surrogate Model-Based Optimisation to Combinatorial and Program Spaces, Hindawi Publishing Corporation Mathematical Problems in Engineering Volume 2014, Article ID 184540, 10 pages",
            "Yourim Yoon and Yong-Hyuk Kim, A Mathematical Design of Genetic Operators on , Hindawi Publishing Corporation Mathematical Problems in Engineering Volume 2014, Article ID 540936, 8 pages",
            "Yourim Yoon and Yong-Huyk Kim, Effective Scheduling of Residential Energy Storage Systems Under Dynamic Pricing, Renewable Energy 87 (2016) 936-945",
            "Yourim Yoon and Yong-Hyuk Kim, Charge Scheduling of an Energy Storage System under Time-of-Use Pricing and a Demand Charge, Hindawi Publishing Corporation e Scientiﬁc World Journal Volume 2014, Article ID 937329, 9 pages"
        ]
    },
    "refereed international conference papers": {
        "header": "Refereed International Conference Papers",
        "body": [
             "Joon-Yeop Lee, Yong-Hyuk Kim, Yourim Yoon, An NFC-based O2O Service Model in Exhibition-space, ICEC '16 Proceedings of the 18th Annual International Conference on Electronic Commerce: e-Commerce in Smart connected World Article No. 42",
            "Yong-Wook Nam, Yong-Hyuk Kim, Filtering Commercial Tweets Using Machine Learning from Twitter Data, The 6th International Conference on Convergence Technology in 2016 June 29",
            "Yong-Wook Nam, Yong-Hyuk Kim, Melody Composition Using Geometric Crossover for Variable-length Encoding, GECCO ’17 Companion, Berlin, Germany",
            "Chanju Jung, Yong-Hyuk Kim, Yourim Yoon, and Byung-Ro Moon, An Adaptive Method of Hungarian Mating Schemes in Genetic Algorithms, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1413-1414, 2015. (poster)",
            "Jae-Hyun Seo, Eun-Sol Ko, Yong-Hyuk Kim, Performance Comparison of GPUs with a Genetic Algorithm based on CUDA, Advanced Science and Technology Letters, Vol. 65 (Database 2014), pp. 36-40, 2014.",
            "Min-Ki Lee, Seung-Hyun Moon, Yong-Hyuk Kim, and Byung-Ro Moon, Correcting Abnormalities in Meteorological Data by Machine Learning, IEEE International Conference on Systems, Man, and Cybernetics, pp. 902-907, 2014.",
            "Chanju Jung, Yong-Hyuk Kim, Yourim Yoon, and Byung-Ro Moon, Investigation of Hungarian Mating Schemes for Genetic Algorithms, (ACM SIGAPP) Annual ACM Symposium on Applied Computing, pp. 140-147, 2014. (acceptance rate: 24%)",
            "Yourim Yoon, Sang-Won Kim, Rex Yang, and Yong-Hyuk Kim, A Genetic Algorithm for Charge Scheduling of Energy Storage System, IEEE International Workshop on Intelligent Energy Systems, 2013. (accepted, but waived)",
            "Jae-Hyun Seo, Yong Hee Lee, and Yong-Hyuk Kim, Optimal Feature Selection for Heavy Drought Classification, Proceedings of the 2nd International Conference on Engineering and Applied Science (ICEAS), pp. 1704-1710, 2013. (ISBN 978-986-87417-1-3)",
            "Tae-Seok Choi, Seung-Hwan Seo, Hyoung-Ju Mun, Jae-Hyun Seo, and Yong-Hyuk Kim, Analyzing the Influence of Twitter through Relationship between Extracted Twitter Issue and News Article, Proceedings of the 2nd International Conference on Engineering and Applied Science (ICEAS), pp. 2464-2471, 2013. (ISBN 978-986-87417-1-3)",
            "Kisung Seo, Soohwan Hyun, and Yong-Hyuk Kim, A Spanning Tree-based Encoding of the MAX CUT Problem for Evolutionary Search, International Conference on Parallel Problem Solving From Nature - Lecture Notes in Computer Science 7491, pp. 510-518, 2012. (link, SCOPUS)",
            "Jae-Hyun Seo and Yong-Hyuk Kim, Genetic Feature Selection for Very Short-Term Heavy Rainfall Prediction, International Conference on Convergence and Hybrid Information Technology - Lecture Notes in Computer Science 7425, pp. 312-322, 2012. (SCOPUS)",
            "Gyung-Mok Yoon, Jin Kim, Yong-Hyuk Kim, and Byung-Ro Moon, Performance Improvement by Adjusting Ratings' Mid-point Value in the Neural Network Based Recommendation Models, 6th International Conference on Computer Sciences and Convergence Information Technology, pp. 813-816, 2011.",
            "So-Yeong Jeon and Yong-Hyuk Kim, New Trials on Test Data Generation: Analysis of Test Data Space and Design of Improved Algorithm, International Conference on Software Engineering Research and Practice, pp. 352-356, 2011. (acceptance rate: 22%)",
            "Gyung-Mok Yoon, Yong-Hyuk Kim, and Byung-Ro Moon, Multicampaign Assignment Reflecting Group-based Response Suppression, International Conference on e-Learning, e-Business, Enterprise Information Systems, and e-Government, pp. 405-411, 2011. (acceptance rate: 21%)",
            "Jin Kim, Inwook Hwang, Yong-Hyuk Kim, and Byung-Ro Moon, Genetic Approaches for Graph Partitioning: A Survey, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 473-480, 2011 (link)",
            "Alberto Moraglio, Yong-Hyuk Kim, and Yourim Yoon, Geometric Surrogate-Based Optimisation for Permutation-Based Problems, (ACM SIGEVO) Genetic and Evolutionary Computation Conference (Companion Material), pp. 133-134, 2011 (poster, pdf, link)",
            "Yong-Hyuk Kim and Yourim Yoon, New Theoretical Findings in Multiple Personalized Recommendations, (ACM SIGAPP) Annual ACM Symposium on Applied Computing, pp. 94-98, 2010 (conference site, acceptance rate: 27%)",
            "Yong-Hyuk Kim, Wonkook Kim, Kyungsub Min, and Yourim Yoon, Probabilistic Context Prediction Using Time-Inferred Multiple Pattern Networks, (ACM SIGAPP) Annual ACM Symposium on Applied Computing, pp. 1015-1019, 2010 (conference site, acceptance rate: 26%)",
            "Hyunmin Kim and Yong-Hyuk Kim, A Genetic Algorithm for Mobile Keypad Designs with Alphabetical Constraints, International Conference on Genetic and Evolutionary Methods, pp. 275-280, 2009. (conference site, acceptance rate: 26%)",
            "Yong-Hyuk Kim and Yourim Yoon, A New Kernighan-Lin-Type Local Search for the Quadratic Assignment Problem, International Conference on Scientific Computing, pp. 185-189, 2009. (conference site, acceptance rate: 26%)",
            "Hyunmin Kim and Yong-Hyuk Kim, Optimal Designs of Ambiguous Mobile Keypad with Alphabetical Constraints, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1931-1932, 2009. (poster, pdf, link)",
            "Yong-Hyuk Kim, Kang Hoon Lee, and Yourim Yoon, Visualizing the Search Process of Particle Swarm Optimization, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 49-55, 2009. (video, link)",
            "Yong-Hyuk Kim and Yourim Yoon, Representation and Recombination over Nonsingular Binary Matrices, (ACM SIGEVO) World Summit on Genetic and Evolutionary Computation, pp. 855-858, 2009. (poster, pdf, conference site, link)",
            "Yong-Hyuk Kim, Linear Transformation in Pseudo-Boolean Functions, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1117-1118, 2008. (poster, pdf, link)",
            "Yourim Yoon, Yong-Hyuk Kim, and Byung-Ro Moon, Feasibility-Preserving Crossover for Maximum k-Coverage Problem, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 593-598, 2008. (presentation, link)",
            "Yong-Hyuk Kim, Dong-ug Kim, and Sejun Ahn, Extracting Informative Sections of Web Documents Based on Scoring DOM Subtrees, International Conference on Internet Computing, pp. 321-324, 2008. (conference site, acceptance rate: 28%)",
            "Yong-Hyuk Kim, Improved Implementation Choices for Iterative Improvement Partitioning Algorithms on Circuits, International Conference on Computer Design, pp. 30-34, 2008. (conference site, acceptance rate: 27%)",
            "Yong-Hyuk Kim, An Enzyme-Inspired Approach to Surmount Barriers in Graph Bisection, International Conference on Computational Science and Its Applications - Lecture Notes in Computer Science 5072, pp. 841-851, 2008. (SCOPUS, conference site, link)",
            "Jae-Hyun Seo, Yong-Hyuk Kim, Hwang-Bin Ryou, and Seok-Joong Kang, A Genetic Algorithm for Sensor Deployment Based on Two-Dimensional Operators, (ACM SIGAPP) Annual ACM Symposium on Applied Computing, vol. 3, pp. 1812-1813, 2008. (poster, conference site, link)",
            "Inwook Hwang, Yong-Hyuk Kim, and Byung-Ro Moon, Overcoming Barriers by a Cluster-Moving Genetic Algorithm, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, p. 1520, 2007. (poster, pdf, link)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, and Byung-Ro Moon, Geometric Crossovers for Real-code Representation, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, p. 1539, 2007. (poster, pdf, link)",
            "Alberto Moraglio, Yong-Hyuk Kim, Yourim Yoon, Byung-Ro Moon, and Riccardo Poli, Geometric Crossover for Permutations with Repetitions: Application to Graph Partitioning, PPSN Workshop on Evolutionary Algorithms - Bridging Theory and Practice, 2006. (Selected for Journal Publication) (pdf, programme)",
            "Inwook Hwang, Yong-Hyuk Kim, and Byung-Ro Moon, Multi-Attractor Gene Reordering for Graph Bisection, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1209-1215, 2006. (link)",
            "Yong-Hyuk Kim, Yourim Yoon, Alberto Moraglio, and Byung-Ro Moon, Geometric Crossover for Multiway Graph Partitioning, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1217-1224, 2006. (link)",
            "Alberto Moraglio, Yong-Hyuk Kim, Yourim Yoon, Byung-Ro Moon, and Riccardo Poli, Generalized Cycle Crossover for Graph Partitioning, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1421-1422, 2006. (poster, pdf, link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, New Topologies for Genetic Search Space, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 1393-1399, 2005. (link)",
            "Yourim Yoon, Yong-Hyuk Kim, and Byung-Ro Moon, An Evolutionary Lagrangian Method for the 0/1 Multiple Knapsack Problem, (ACM SIGEVO) Genetic and Evolutionary Computation Conference, pp. 629-635, 2005. (link)",
            "Yong-Hyuk Kim, Su-Yeon Lee, and Byung-Ro Moon, A Genetic Approach for Gene Selection on Microarray Expression Data, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 3102, vol. 1, pp. 346-355, 2004. (SCOPUS, link)",
            "Jong-Pil Kim, Yong-Hyuk Kim, and Byung-Ro Moon, A Hybrid Genetic Approach for Circuit Bipartitioning, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 3103, vol. 2, pp. 1054-1064, 2004. (SCOPUS, link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Lagrange Multiplier Method for Multi-Campaign Assignment Problem, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 3103, vol. 2, pp. 1065-1077, 2004. (SCOPUS, link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Distance Measures in Genetic Algorithms, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 3103, vol. 2, pp. 400-401, 2004. (SCOPUS, poster, link)",
            "Yong-Hyuk Kim, Yung-Keun Kwon, and Byung-Ro Moon, Problem-Independent Schema Synthesis for Genetic Algorithms, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2723, pp. 1112-1122, 2003. (SCOPUS, link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Investigation of the Fitness Landscapes and Multi-Parent Crossover for Graph Bipartitioning, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2723, pp. 1123-1135, 2003. (SCOPUS, link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, New Usage of Sammon's Mapping for Genetic Visualization, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2723, pp. 1136-1147, 2003. (SCOPUS, link)",
            "Dong-il Seo, Yong-Hyuk Kim, and Byung-Ro Moon, New Entropy-Based Measures of Gene Significance and Epistasis, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2724, pp. 1345-1356, 2003. (SCOPUS, link)",
            "Yong-Hyuk Kim, Seung-Kyu Lee, and Byung-Ro Moon, Optimizing the Order of Taxon Addition in Phylogenetic Tree Construction Using Genetic Algorithm, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2724, pp. 2168-2178, 2003. (SCOPUS, link)",
            "Seung-Kyu Lee, Yong-Hyuk Kim, and Byung-Ro Moon, Finding the Optimal Gene Order in Displaying Microarray Data, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2724, pp. 2215-2226, 2003. (SCOPUS, link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Multi-Campaign Assignment Problem and Optimizing Lagrange Multipliers, Genetic and Evolutionary Computation Conference - Lecture Notes in Computer Science 2724, pp. 2410-2411, 2003. (SCOPUS, poster, link)",
            "Eun-Jong Park, Yong-Hyuk Kim, and Byung-Ro Moon, Genetic Search for Fixed Channel Assignment Problem with Limited Bandwidth, Genetic and Evolutionary Computation Conference, pp. 1172-1179, 2002. (pdf)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Visualization of the Fitness Landscape, a Steady-State Genetic Search, and Schema Traces, Genetic and Evolutionary Computation Conference, p. 686, 2002. (poster, pdf)",
            "Su-Hyang Kim, Yong-Hyuk Kim, and Byung-Ro Moon, A Hybrid Genetic Algorithm for the MAX CUT Problem, Genetic and Evolutionary Computation Conference, pp. 416-423, 2001. (pdf)",
            "Yong-Hyuk Kim and Byung-Ro Moon, A Hybrid Genetic Search for Graph Partitioning Based on Lock Gain, Genetic and Evolutionary Computation Conference, pp. 167-174, 2000. (pdf)"
        ]
    },
    "technical reports": {
        "header": "Technical Reports",
        "body": [
            "Yourim Yoon and Yong-Hyuk Kim, Charge Scheduling of an Energy Storage System under Time-of-use Pricing and a Demand Charge, CoRR abs/1407.3077, July 2014. (link)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, Byung-Ro Moon, Mathematical Interpretation between Genotype and Phenotype Spaces and Induced Geometric Crossovers, CoRR abs/0907.3202, July 2009. (link)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, Byung-Ro Moon, A Mathematical Unification of Geometric Crossovers Defined on Phenotype Space, CoRR abs/0907.3200, July 2009. (link)",
            "Yong-Hyuk Kim and Yourim Yoon, A Note on Mathematical Modelling of Practical Multicampaign Assignment and Its Computational Complexity, CoRR abs/0906.5475, June 2009. (link)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, and Byung-Ro Moon, Quotient Geometric Crossover, Technical Report CSM-467, University of Essex, 2007. (pdf)",
            "Yourim Yoon, Yong-Hyuk Kim, Alberto Moraglio, and Byung-Ro Moon, Geometric Crossovers for Real-code Representation, Technical Report CSM-466, University of Essex, 2007. (pdf)",
            "Alberto Moraglio, Yong-Hyuk Kim, Yourim Yoon, Byung-Ro Moon, and Riccardo Poli, Cycle Crossover for Permutations with Repetitions, Technical Report CSM-454, University of Essex, 2006. (pdf)",
            "Alberto Moraglio, Yong-Hyuk Kim, Yourim Yoon, Byung-Ro Moon, and Riccardo Poli, Geometric Crossover for Permutations with Repetitions: Applications to Graph Partitioning, Technical Report CSM-448, University of Essex, 2006. (pdf)"
        ]
    },
    "domestic books": {
        "header": "Domestic Books",
        "body": [
            "Inwook Hwang and Yong-Hyuk Kim, Algorithms through Solving Problems: Programming Training Q&A, Insight, August 2012. (Nominated in the 10th Books of the Year, YES24, 2012): sixth impression on Oct. 2015. (gross sales from Aug. 2012 to Sep. 2015: about 5,600)",
            "Yong-Hyuk Kim, [IT CookBook] Artificial Intelligence (Korean translation), Hanbit Media, November 2009. (link, published thanks to Jin Kim, Yourim Yoon, and Ki Bum Kim, listed in 2010 Excellent Books for the Basic Sciences at the National Academy of Sciences, Korea): fourth impression since Aug. 2013. (gross sales from 2009 to 2013: about 3,400)"
        ]
    },
    "refereed domestic journal papers": {
        "header": "Refereed Domestic Journal Papers",
        "body": [
            "Yong-Wook Nam and Yong-Hyuk Kim, Speed estimation of sound-emitted objects through convergence of sound information analysis and smart device technology, Journal of the Korea Convergence Society, Oct. 2015. (accepted)",
            "Sung-Joon Lim, Sung-Kwun Oh, Yong-Hyuk Kim, and Yong Hee Lee, A Study on Heavy Rainfall Guidance Realized with the Aid of Neuro-Fuzzy and SVR Algorithm Using AWS Data, The Transactions of the Korean Institute of Electrical Engineers, 63(4):526-533, 2014. (link)",
            "Yong-Hyuk Kim, Swarm Intelligence, World of Electricity, 62(7):22-26, 2013. (link)",
            "Jae-Hyun Seo, Yong Hee Lee, and Yong-Hyuk Kim, Feature Selection to Predict Very Short-term Heavy Rainfall Based on Differential Evolution, Journal of Korean Institute of Intelligent System, 22(6):706-714, 2012. (link)",
            "Soohwan Hyun, Yong-Hyuk Kim, and Kisung Seo, A Spanning Tree-based Representation and Its Application to the MAX CUT Problem, Journal of Institute of Control, Robotics and Systems, 18(12):1096-1100, 2012. (link)",
            "So-Yeong Jeon and Yong-Hyuk Kim, Analyzing Problem Instance Space Based on Difficulty-distance Correlation, Journal of Korean Institute of Intelligent Systems, 22(4):414-424, 2012. (link)",
            "Yourim Yoon and Yong-Hyuk Kim, A Lagrangian Heuristic for the Multidimensional 0-1 Knapsack Problem, Journal of Korean Institute of Intelligent Systems, 20(6):755-760, 2010. (link)",
            "Yourim Yoon and Yong-Hyuk Kim, Genetic Algorithms for Maximizing the Coverage of Sensor Deployment, Journal of Korean Institute of Intelligent Systems, 20(3):406-412, 2010. (link)",
            "Ju-Sung Kye, Yong-Hyuk Kim, and Woo-Sang Kim, Graph Visualization Using Genetic Algorithms of Preserving Distances between Vertices and Minimizing Edge Intersections, Journal of Korean Institute of Intelligent Systems, 20(2):234-242, 2010. (link)",
            "Hyunmin Kim and Yong-Hyuk Kim, Algorithms for Designing Optimal Keypads of Mobile Devices, Journal of Korean Institute of Intelligent Systems, 19(6):814-820, 2009. (link)",
            "Yung-Keun Kwon, Yong-Hyuk Kim, and Byung-Ro Moon, Problem-Independent Gene Reordering for Genetic Algorithms, Journal of Korea Information Science Society B: Software and Applications, 32(10):974-983, 2005. (link)",
            "Yong-Hyuk Kim and Byung-Ro Moon, Optimization of Multiple Campaigns Reflecting Multiple Recommendation Issue, Journal of Korea Information Science Society B: Software and Applications, 32(5):335-345, 2005. (link)",
            "Gyoung-Do Kim, Yong-Hyuk Kim, A Survey on Oil Spill and Weather Forecast Using Machine Learning Based on Neural Networks and Statistical Methods, Journal of the Korea Convergence Society Vol. 8. No. 10, pp.1-8, 2017",
            "Yong-Wook Nam, Yong-Hyuk Kim, An Algorithm for Generating Suitable Accompaniment in Score-writers, Asia-pacific Journal of Multimedia Services Convergent with Art, Humanities, and Sociology Vol.6, No.3, March (2016), pp. 31-39",
            "Chan-Jae Lee, Gyoung-Do Kim, Yong-Hyuk Kim, Performance Comparison of Machine Learning Based on Neural Networks and Statistical Methods for Prediction of Drifter Movement, Journal of the Korea Convergence Society Vol. 8. No. 10, pp.45-52, 2017",
            "Ji-Hun Ha, Yong-Hyuk Kim, Hyo-Hyuc Im, Deokwhan Choi, and Yong Hee Lee, A Method for Correcting Air-Pressure Data Collected by Mini-AWS, Journal of Korean Institute of Intelligent Systems, Vol. 26, No. 3, June 2016, pp. 182-189",
            "Ji-Hun Ha, Yong Hee Lee, and Yong-Hyuk Kim, Forecasting the Precipitation of the Next Day Using Deep Learning, Journal of Korean Institute of Intelligent Systems, Vol. 26, No. 2, April 2016, pp. 093-098",
            "Ji-Hun Ha, Yong-Hyuk Kim, and Yong Hee Lee, Applying Artificial Neural Networks for Estimation of Planetary Boundary Layer Height, Journal of Korean Institute of Intelligent Systems, Vol. 27, No. 4, August 2017, pp. 302-309",
            "Joon-Yeop Lee, Yong-Hyuk Kim, Evaluation Model Based on Machine Learning for Optimal O2O Services Layout(Placement) in Exhibition-spac, Asia-pacific Journal of Multimedia Services Convergent with Art, Humanities, and Sociology Vol.6, No.3, March (2016), pp. 291-300",
            "Ji-Hun Ha, Hyo-Hyuk Im, Yong-Hyuk Kim, Counting Harmful Aquatic Organisms in Ballast Water through Image Processing, Asia-pacific Journal of Multimedia Services Convergent with Art, Humanities, and Sociology Vol.6, No.3, March (2016), pp. 383-391"
        ]
    },
    "domestic conference paper": {
        "header": "Domestic Conference Paper",
        "body": [
            "Sung-Ho Yoon, Dong-Won Kim, Min-Sun Oh, Yong-Wook Nam, and Yong-Hyuk Kim, Analysis of Smartphone Sensor Data for Improving the Reliability of Weather Information, Proceedings of KIIS Spring Conference, Vol. 25, No 1, pp. 202-204, 2015. (link)",
            "Yong-Wook Nam and Yong-Hyuk Kim, Design of Fitness Function for an Automatic Composing System Using Machine Learning, Proceedings of KIIS Spring Conference, Vol. 25, No 1, pp. 211-212, 2015. (link)",
            "Yong-Wook Nam, So-Jung Kim, Han-Kyung Cho, Min-Ji Seo, Dong-Won Kim, and Yong-Hyuk Kim, Automatic Score Drawing Technique through Smart Device, Proceedings of KIIS Fall Conference, Vol. 24, No 2, pp. 165-166, 2014.",
            "Yong-Wook Nam and Yong-Hyuk Kim, A Survey on Automatic Composition Based on Genetic Algorithms, Proceedings of KIIS Fall Conference, Vol. 24, No 2, pp. 167-168, 2014.",
            "Yong-Wook Nam, Dong-Won Kim, Yong Hee Lee, and Yong-Hyuk Kim, A Survey on Quality Control of Automatic Weather Station, Proceedings of the Korea Computer Congress 2014, pp. 16-18, 2014.",
            "Jae-Hyun Seo and Yong-Hyuk Kim, A Survey on Parallel Evolutionary Computation using CUDA, Proceedings of the Korea Computer Congress 2014, pp. 722-724, 2014.",
            "Jae-Hyun Seo, Yong-Wook Nam, and Yong-Hyuk Kim, A Survey on Optimal Sensor Deployment Based on Evolutionary Computation, Proceedings of the Korea Computer Congress 2014, pp. 843-845, 2014.",
            "Jae-Hyun Seo, Dong-Won Kim, Yong Hee Lee and Yong-Hyuk Kim, Short-Term Drought Prediction Using WEKA, Proceedings of the KIISE 2013 Fall Conference, pp. 646-648, 2013.",
            "Yong-Wook Nam and Yong-Hyuk Kim, Minimum Movement for Randomized Tower of Hanoi, Proceedings of the KIISE 2013 Fall Conference, pp. 726-728, 2013.",
            "Dong-Won Kim, Jae-Hyun Seo, and Yong-Hyuk Kim, Wine Classification and Wine Quality Prediction Using Machine Learning, Proceedings of KIIS Spring Conference, Vol. 23, No. 1, pp. 14-16, 2013. (link)",
            "Jeonghoon Yun, Seongwon Lim, and Yong-Hyuk Kim, Design of a Robot Using NXT 2.0 for Exploring Mazes with Obstacles, Proceedings of the KIISE 2012 Fall Conference, Vol. 39, No. 2(B), pp. 207-209, 2012. (Written in English, link)",
            "Yong-Ho Ha, Seongwon Lim, and Yong-Hyuk Kim, Trend Analysis through Content-based Tweet Clustering, Proceedings of the KIISE 2012 Fall Conference, Vol. 39, No. 2(B), pp. 210-212, 2012. (link)",
            "Sehoon Seo, Seongwon Lim, and Yong-Hyuk Kim, Detecting Communities through Social Network Clustering, Proceedings of the KIISE 2012 Fall Conference, Vol. 39, No. 2(B), pp. 213-215, 2012. (link)",
            "Ye-ra Lee, Yeo-Jin Yoo, and Yong-Hyuk Kim, An Analysis of Social Networks in a Small Group on Facebook, Proceedings of the KMMS 2012 Fall Conference, Vol. 15, No. 2, pp. 378-381, 2012.",
            "Tae-Seok Choi, Seung-Hwan Seo, Hyoung-Ju Mun, and Yong-Hyuk Kim, Analyzing the Influence of Twitter through Relationship between Extracted Twitter Issue and News Article, Proceedings of the KMMS 2012 Fall Conference, Vol. 15, No. 2, pp. 392-396, 2012.",
            "Jin-Sung Kim, Hyun-Woo Cho, Eun-Kyu Lee, Jae-Hyun Seo, and Yong-Hyuk Kim, Web Crawling and TunkRank Extension for Evaluation of Twitter Users' Influence on the Areas, Proceedings of the KMMS 2012 Fall Conference, Vol. 15, No. 2, pp. 413-416, 2012.",
            "Jae-Hyun Seo, Yong Hee Lee, and Yong-Hyuk Kim, Short-Term Drought Prediction Based on Machine Learning, Proceedings of KIIS Fall Conference, Vol. 22, No 2, pp. 165-167, 2012. (link)",
            "Yong-Sung Lim, Chul-Su Kim, Yeon-Sun Hwang, and Yong-Hyuk Kim, A Forecast Method Based on Pattern Networks of Heavy Rain, Proceedings of KIIS Fall Conference, Vol. 22, No 2, pp. 182-184, 2012. (link)",
            "Jae-Hyun Seo and Yong-Hyuk Kim A Survey on Rainfall Forecast Algorithms Based on Machine Learning Technique, Proceedings of KIIS Fall Conference, Vol. 21, No 2, pp. 218-221, 2011. (link)",
            "Jae-Hyun Seo, Yong-Sung Lim, and Yong-Hyuk Kim, Feature Selection for Forecasting a Short-Term Heavy Rainfall using a Genetic Algorithm, Proceedings of the KIISE 2011 Fall Conference, Vol. 38, No. 2(B), pp. 327-330, 2011. (link)",
            "Ha-yan Park and Yong-Hyuk Kim, Season Classification Using Support Vector Machine, Proceedings of the KIISE 2011 Fall Conference, Vol. 38, No. 2(B), pp. 371-374, 2011. link)",
            "Dae-Yeon Won, Ki-Jung Park, Young-Jun Park, Gyu-Bae Shim, Jae-Woong Lee, and Yong-Hyuk Kim, Spam Twit Filtering using Naive Bayesian Algorithm and URL Analysis, Proceedings of the KIISE 2011 Fall Conference, Vol. 38, No. 2(B), pp. 375-378, 2011. (link)",
            "Dongkyun Kim, Jiyong Heo, Jihoon Cho, Soo-Young Park, and Yong-Hyuk Kim, Emotional Twitter Bot Based on Machine Learning, Proceedings of the KIISE 2011 Fall Conference, Vol. 38, No. 2(B), pp. 379-382, 2011. (link)",
            "Jeonghun Kang, Cheong-han Kim, Seonmi Yoo, Yong-ju Lee, Ha-yan Park, and Yong-Hyuk Kim, Recommendation of Acquaintances to Follow in Twitter, Proceedings of the KIISE 2011 Fall Conference, Vol. 38, No. 2(B), pp. 383-386, 2011. (link)",
            "Ju-Hyun So, Byeong-Hyun Choi, Ji-Young Song, and Yong-Hyuk Kim, A System for Twitting User Information Based on Android Smart Phone, Proceedings of the KIISE 2011 Fall Conference, Vol. 38, No. 2(D), pp. 93-96, 2011. (link)",
            "Jae-Hyun Seo and Yong-Hyuk Kim, An Optimal Route Selection for Improving Energy Efficiency in TORA, Proceedings of the Korea Computer Congress 2011, Vol. 38, No. 1(A), pp. 355-358, 2011. (link)",
            "Soohwan Hyun, Yong-Hyuk Kim, and Kisung Seo, A New Genetic Algorithm Using Spanning-Tree-Based Encoding for the MAX CUT Problem, Proceedings of KIIS Fall Conference, Vol. 20, No 2, pp. 231-234, 2010. (link)",
            "Soo-Young Park, Yong-Ho Ha, and Yong-Hyuk Kim, Recent Studies on Twitter in the Field of Information Retrieval, Proceedings of the KIISE 2010 Fall Conference, Vol. 37, No. 2(C), pp. 25-29, 2010. (link)",
            "Seo-hye Kang, Sung-bong Kang, Hee-jin Ku, Ju-young Lee, Ha-yan Park, and Yong-Hyuk Kim, A Method for Multi-Project Member Assignment Considering Personal Relationship, Proceedings of the KIISE 2010 Fall Conference, Vol. 37, No. 2(C), pp. 124-128, 2010. (link)",
            "So-Yeong Jeon and Yong-Hyuk Kim, Finding the Best-case Instance for Analyzing Algorithms: Comparing with the Results of Finding the Worst-case Instance, Proceedings of the KIISE 2010 Fall Conference, Vol. 37, No. 2(C), pp. 145-150, 2010. (link)",
            "Ji Hoon Bae, Eun Ji Park, Da Seul Lee, Ji Won Goh, Hyunmin Kim, and Yong-Hyuk Kim, Recommendation of TV Program Based on Personalized Websurfing Information, Proceedings of the KIISE 2010 Fall Conference, Vol. 37, No. 2(C), pp. 217-221, 2010. (link)",
            "So-Yeong Jeon and Yong-Hyuk Kim, Finding the Worst-case Instances of Some Sorting Algorithms Using Genetic Algorithms, Proceedings of the Korea Computer Congress 2010, Vol. 37, No. 1(B), pp. 1-5, 2010. (link)",
            "Hyunmin Kim and Yong-Hyuk Kim, Design of Efficient Mobile Keypad Based on Automatic Word Spacing, Proceedings of the Korea Computer Congress 2010, Vol. 37, No. 1(B), pp. 153-156, 2010. (link)",
            "Ha-yan Park, Yong-Hyuk Kim, and Yourim Yoon, A Design Methodology of Meta Genetic Algorithms Using Nonsigular Binary Matrices, Proceedings of the Korea Computer Congress 2010, Vol. 37, No. 1(B), pp. 508-513, 2010. (link)",
            "Jin-Hwa Kim and Yong-Hyuk Kim, Latent Semantic Indexing Using Sematic Diffusion, Proceedings of the Korea Computer Congress 2010, Vol. 37, No. 1(C), pp. 16-21, 2010. (link)",
            "Soo-Young Park and Yong-Hyuk Kim, Some Issues for Improving Probabilistic Context Prediction, Proceedings of the Korea Computer Congress 2010, Vol. 37, No. 1(C), pp. 474-479, 2010. (link)",
            "Hyunmin Kim and Yong-Hyuk Kim, Classification of Social Relationship Based on Mobile Communication Patterns, Proceedings of the KIIS Fall Conference 2009, Vol. 19, No. 2, pp. 227-230, 2009. (link)",
            "Sa-Yong Hong, Hyunmin Kim, and Yong-Hyuk Kim, Feature Selection for Effective Genre Classification of MIDI Files, Proceedings of the KIIS Fall Conference 2009, Vol. 19, No. 2, pp. 234-237, 2009. (link)",
            "Seung-bum Kim, Moon-jung Choi, Yeong-sin Lee, and Yong-Hyuk Kim, Generating Patterns Using Interactive Genetic Algorithms, Proceedings of the KIISE 2009 Fall Conference, Vol. 36, No. 2(C), pp. 225-228, 2009. (link)",
            "Sung-Hwan Jang, Hyoung Kim, Seongwoo Lee, Hyunmin Kim, and Yong-Hyuk Kim, Genre Classifier Using Machine Learning and Representative Segments for MIDI files, Proceedings of the KIISE 2009 Fall Conference, Vol. 36, No. 2(C), pp. 375-378, 2009. (link)",
            "Hyunmin Kim and Yong-Hyuk Kim, Design of Efficient Mobile Keypad Using Genetic Algorithms, Proceedings of the KIIS Spring Conference 2009, Vol. 19, No. 1, pp. 295-298, 2009. (link)",
            "Sung-Ju Park, Ha-yan Park, and Yong-Hyuk Kim, A Parallel Processing Method of Relative Keyword Recommendation through Analyzing Search Results, Proceedings of the KIISE 2008 Fall Conference, Vol. 35, No. 2(C), pp. 214-217, 2008. (link)",
            "So-jin Nam, Do-Hoon Kim, Wan-Jung Kim, Yong-Hyuk Kim, DOM-based Content Extraction for Improving Performance of Web Service, Proceedings of the KIISE 2008 Fall Conference, Vol. 35, No. 2(C), pp. 218-222, 2008. (link)",
            "Ju-Sung Kye, Yong-Hyuk Kim, and Woo-Saeng Kim, A Genetic Algorithm for Visualizing Graphs Considering the Minimization of Edge Crossing, Proceedings of the KMMS Spring Conference, pp. 467-470, 2008.",
            "Jin Seop Han, Yong-Hyuk Kim, Changhee Han, and Byung Joon Park, Trend of an Agent Based Intelligent Computer Generated Forces Technology for the Defence Modeling and Simulation, The Third National Defence Information and Control Technology Conference, pp. 151-153, 2007.",
            "Sung-Pil Hong and Yong-Hyuk Kim, A Genetic Algorithm for Inventory Control of Multi-items Sharing a Fixed Cost, Proceedings of the KIIE Autumn Conference, 2006. (pdf)",
            "Seungjun Lim, Yong-Hyuk Kim, Juntae Choi, Sangwon Joo, A Study on AWS Quality Control Method Design Based on Machine Learning, 2015 Korea Meteorological Society Regular General Assembly and Autumn Conference",
            "Sungjae Cho, Jae-Gwan Jang, Yong-Hyuk Kim, A Method to Recommend Korean History Wikipedia Documents Next to Read Using Document Links and Word2vec, KOREA INFORMATION SCIENCE SOCIETY Academic Publications, 2017.06, pp. 1814-1816",
            "Joon-Yeop Lee and Yong-Hyuk Kim, Design of Optimal Advertising Layout in Exhibit Space, Proceeding of KIIS Autumn Conference 2015 Vol. 25, No. 2.",
            "Cheol-Ho Kim, Seong-Hwan Kim, Seong-Min Lim, Yong-Hyuk Kim, Very Short-term Weather Pridiction Using Support Vector Regression Based on AWS Data, Proceeding of KIIS Autumn Conference 2015 Vol. 25, No. 2.",
            "Ji-Hun Ha, Yong-Hyuk Kim, Na-Young Kim, Hyo-Hyuc Im, Sangjin Sim, Reno K. Y. Choi, Proceeding of KIIS Autumn Conference 2015 Vol. 25, No. 2.",
            "Ji-Hun Ha, Yong-Hyuk Kim, Yong-Hee Lee, Forecast the Precipitation of the Next Day Using Deep Learning, Proceeding of KIIS Autumn Conference 2015 Vol. 25, No. 2.",
            "Seungjun Lim, Yong-Hyuk Kim, Juntae Choi, Sangwon Joo, A Study on AWS Quality Control Method Design Based on Machine Learning, Proceedings of the Autumn Meeting of KMS, 2015",
            "Hye-Jin Kim, Yong-Hyuk Kim, Extraction of Personal Information Using Face Recognition  Based on Deep Learning , 2017 Korea Multimedia Society Spring Conference, Vol. 20, No.1",
            "Hwi-Yeon Cho, Hye-Jin Kim, Eun-Chan Lee, Min-Jung Lee, Yong-Wook Nam, Yong-Hyuk Kim, Twitter Data Collection to Build Customized Tweet Recommendation System, 2017 Korea Multimedia Society Spring Conference, Vol. 20, No.1",
            "Yong-Wook Nam, Yong-Hyuk Kim, An Algorithm for Selecting Suitable Chord Tones in Score-writers, Convergence Research Letter Vol.2, No.1, January (2016), pp.477-482",
            "Joon-Yeop Lee, Yong-Hyuk Kim, Evaluation Model of Exhibition-space Cells Using Machine Learning and Space Syntax, Convergence Research Letter Vol.2, No.1, January (2016), pp.507-511",
            "Ji-hun Ha, Hyo-Hyuk Im, Yong-Hyuk Kim, An Image Processing Algorithm for Counting Harmful Aquatic Organisms, Convergence Research Letter Vol.2, No.1, January (2016), pp.431-434",
            "Ji-Hun Ha, Hyo-Hyuc Im, Yong-Hyuk Kim, Image Processing Algorithm for the Measurement of the Number of Habitat Submerged Species, Convergence Research Letter, January 2016, Vol. 2, No.1",
            "Yong-Wook Nam and Yong-Hyuk Kim, Effective Code Tone Selection Algorithm of Sabo Program, Convergence Research Letter, January 2016, Vol. 2, No.1",
            "Joon-Yeop Lee, Yong-Hyuk Kim, Evaluation model of exhibition space elements using machine learning and spatial syntax, Convergence Research Letter, January 2016, Vol. 2, No.1",
            "Gyoung-Do Kim, Chan-Jea Lee, Yong-Hyuk Kim, Prediction of the Movement Path of Drifters Using Machine Learning, The Korean Association of Ocean Science and Technology Societies Joint Conference, 2017",
            "Yong-Wook Nam, Yong-Hyuk Kim, A System of Storing Important Opinion about Twitter Trends, Korea Computer Congress 2016",
            "Ji-Hun Ha, Yong-Hyuk Kim, A Survey on Denoising Autoencoder, Korea Computer Congress 2016",
            "Hojeon Lee, Yourim Yoon, Yong-Hyuk Kim, A Study on Improvement Plan for Industrial Load Forecasting, Korea Computer Congress 2016",
            "Yong-Wook Nam, Yong-Hyuk Kim, Implementation of a Third-Party Application that Improves Twitter's Search Service, Convergence Research Letter Vol.3, No.4, October (2017), pp.667-670",
            "Chan-Jae Lee, Yong-Hyuk Kim, Prediction of Drifter Trajectory Using an Ensemble Technique, Convergence Research Letter Vol.3, No.4, October (2017), pp.671-674",
            "Dong-Pil Yu, Yong-Hyuk Kim, Relationship between Epistasis on Performance of Genetic Algorithm, Convergence Research Letter Vol.3, No.4, October (2017), pp.675-680",
            "Jung-Hwan Lee, Yong-Hyuk Kim, Yong Hee Lee, Application of Random Forest to Ceilometer Data for Precipitation Detection, Convergence Research Letter Vol.3, No.4, October (2017), pp.681-684",
            "Hwi-Yeon Cho, Yong-Hyuk Kim, Solving the Subset-Sum Problem Using a Genetic Algorithm, Convergence Research Letter Vol.3, No.4, October (2017), pp.685-689",
            "Hwi-Yeon Cho, Yong-Hyuk Kim, Hyo-Hyuk Im, Prediction of Wind-Shear Alert Using Deep Learning, Convergence Research Letter Vol.3, No.4, October (2017), pp.691-695",
            "Yeong-cheol Jang, Hyo-Jong Kim, Da-Sol Song, Yong-Hyuk Kim, Prediction of Stock Price Change Using Twitter and Machine Learning, The Institute of Electronics and Information Engineers Fall Conference, 2017",
            "Hyo-Jun Jeon, Chan-Hyeong Lee, Yong-Hyuk Kim, Positive/Negative Classification of Morpheme in Product Reviews Using Word2Vec, The Institute of Electronics and Information Engineers Fall Conference, 2017",
            "Hye-Jin Kim, Yong-Hyuk Kim, Classification od Copyrighted Design in Instagram Using Convolutional Neural Networks, The Institute of Electronics and Information Engineers Fall Conference, 2017",
            "Hye-Jin Kim, Yong-Hyuk Kim, Classification od Copyrighted Design in Instagram Using Convolutional Neural Networks, The Institute of Electronics and Information Engineers Fall Conference, 2017",
            "Gyoung-Do Kim, Yong-Hyuk Kim, A Survey Prediction Using Convolutional Neural Networks, Proceedings og KIIS Autumn Conference 2016 Vol. 26, No. 2.",
            "Ji-Hun Ha, Yong-Hyuk Kim, Yong-Hee Lee, Height Estimation of the Atmospheric Boundary Layer Using Machine Learning, Proceeding of KIIS Autumn Conference 2016 Vol. 26, No. 2.",
            "Joon-Yeop Lee and Yong-Hyuk Kim, An Efficient Placement of O2O Services in Exhibition-space, Proceeding of KIIS Autumn Conference 2016 Vol. 26, No. 2.",
            "Jong-Hwan Lee, Hee-Chan Yoo, Yong-Bum Cho, Yong-Wook Nam, Yong-Hyuk Kim, A system for Analyzing Population Density and Movement Stastics Through Geotagged Tweet Data, Proceeding of KIIS Autumn Conference 2016 Vol. 26, No. 2.",
            "Ji-Hye Kim, Ri-Su Yoo, So-Yeon Lee, Joon-Yeop Lee and Yong-Hyuk Kim, Optomization of NFC-based Advertising palced within exhibition-space, Proceeding of KIIS Autumn Conference 2016 Vol. 26, No. 2.",
            "Yong-Wook Nam, Yong-Hyuk Kim, A System for Detection Influential Opinions Based on the Number of Retweets, Proceeding of KIIS Autumn Conference 2016 Vol. 26, No. 2.",
            "Jong-Hwan Lee, Hee-Chan Yoo, Yong-Bum Cho, Yong-Wook Nam, Yong-Hyuk Kim, Developing a System for Polulation Density and Movement Stastics Through Real-Time Collenction of Twitter Dta, Proceeding of KIIS Spring Conference 2016 Vol. 26, No. 1.",
            "Sung-Jin Yang, Jung-Woo Choi, Sang-Ho Moon, Yeon-Woo Jung, Yong-Wook Nam, Yong-Hyuk Kim, Opinion Mining Using Retweet Function of Twitter, Proceeding of KIIS Spring Conference 2016 Vol. 26, No. 1.",
            "Ji-Hun Ha, Yong-Hyuk Kim, Hyo-Hyuc Im, Deokwhan Choi, Yong Hee Lee, A Method for Correcting Air-Pressure Data Collected by Mini-AWS, Proceeding of KIIS Spring Conference 2016 Vol. 26, No. 1.",
            "Joon-Yeop Lee, Yong-Hyuk Kim, A Case Study of O2O Services in Indoor Space and Proposal od O2O Services Placement Platform Based on NFC, Proceeding of KIIS Spring Conference 2016 Vol. 26, No. 1.",
            "Dong-Won Kim, Sung-Ho Yoon, Min Seon Oh, Jong-Hwan Lee, Yong-Wook Nam, Yong-Hyuk Kim, Improvement of Weather Forecast Accuracy by Smartphone Sensor, Proceeding of KIIS Spring Conference 2016 Vol. 26, No. 1."
        ]
    },
    "additional domestic conference talks": {
        "header": "Additional Domestic Conference Talks",
        "body": [
            "Yong-Hyuk Kim and Sejun Ahn, A Survey on String Manipulation Methods, Daum-Lycos Developer Conference, 2006.",
            "Sung-Pil Hong and Yong-Hyuk Kim, A Genetic Algorithm for Inventory Control of Multi-items Sharing a Fixed Cost, 12-th KIIE Cyber Conference, 2007."
        ]
    },
    "unpublished domestic books": {
        "header": "Unpublished Domestic Books",
        "body": [
            "Yong-Hyuk Kim et al., Introduction to Embedded Software, 2009.",
            "Yong-Hyuk Kim, Problem-Solving through Programming, 3rd ed., OCCA Press, September 2003."
        ]
    },
    "patents": {
        "header": "Patents",
        "body": [
            "사용자 인터페이스 설계자 장치 및 그의 정보 처리 방법, 특허등록 제 10-1707827 호, 발명자 : 안대윤, 오종민, 우승현, 김용혁 / 특허권자 : 현대자동차주식회사, 기아자동차주식회사, 광운대학교 산학협력단",
            "사용자 인터페이스 설계자 장치 및 그의 정보 처리 방법, 특허등록 제 10-1707862 호, 발명자 : 안대윤, 오종민, 우승현, 김용혁 / 특허권자 : 현대자동차주식회사, 기아자동차주식회사, 광운대학교 산학협력단",
            "유출유 확산 예측을 위한 입자 추적 모듈 최적화 방법 및 이를 이용한 예측 시스템, 출원 번호 10-2017-0167794, 발명자 김도연, 김용혁, 김충기, 오정환, 김성은, 박상훈 (출원)"
        ]
    }
}
